{
  "char_to_idx": {
    "\n": 0,
    " ": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "$": 5,
    "%": 6,
    "&": 7,
    "'": 8,
    "(": 9,
    ")": 10,
    "*": 11,
    "+": 12,
    ",": 13,
    "-": 14,
    ".": 15,
    "/": 16,
    "0": 17,
    "1": 18,
    "2": 19,
    "3": 20,
    "4": 21,
    "5": 22,
    "6": 23,
    "7": 24,
    "8": 25,
    "9": 26,
    ":": 27,
    ";": 28,
    "<": 29,
    "=": 30,
    ">": 31,
    "?": 32,
    "@": 33,
    "A": 34,
    "B": 35,
    "C": 36,
    "D": 37,
    "E": 38,
    "F": 39,
    "G": 40,
    "H": 41,
    "I": 42,
    "J": 43,
    "K": 44,
    "L": 45,
    "M": 46,
    "N": 47,
    "O": 48,
    "P": 49,
    "Q": 50,
    "R": 51,
    "S": 52,
    "T": 53,
    "U": 54,
    "V": 55,
    "W": 56,
    "X": 57,
    "Y": 58,
    "Z": 59,
    "[": 60,
    "\\": 61,
    "]": 62,
    "^": 63,
    "_": 64,
    "`": 65,
    "a": 66,
    "b": 67,
    "c": 68,
    "d": 69,
    "e": 70,
    "f": 71,
    "g": 72,
    "h": 73,
    "i": 74,
    "j": 75,
    "k": 76,
    "l": 77,
    "m": 78,
    "n": 79,
    "o": 80,
    "p": 81,
    "q": 82,
    "r": 83,
    "s": 84,
    "t": 85,
    "u": 86,
    "v": 87,
    "w": 88,
    "x": 89,
    "y": 90,
    "z": 91,
    "{": 92,
    "|": 93,
    "}": 94,
    "~": 95,
    "\u00a1": 96,
    "\u00a4": 97,
    "\u00a7": 98,
    "\u00a8": 99,
    "\u00ac": 100,
    "\u00af": 101,
    "\u00b0": 102,
    "\u00b1": 103,
    "\u00b4": 104,
    "\u00b7": 105,
    "\u00b8": 106,
    "\u00ba": 107,
    "\u00e9": 108,
    "\u00f2": 109,
    "\u00f6": 110,
    "\u00f7": 111,
    "\u02bc": 112,
    "\u02cf": 113,
    "\u0398": 114,
    "\u03a6": 115,
    "\u2026": 116,
    "\u203c": 117,
    "\u221f": 118,
    "\u250c": 119,
    "\u2510": 120,
    "\u2514": 121,
    "\u2518": 122,
    "\u2524": 123,
    "\u2551": 124,
    "\u2580": 125,
    "\u2582": 126,
    "\u2584": 127,
    "\u2588": 128,
    "\u258c": 129,
    "\u2590": 130,
    "\u2591": 131,
    "\u2592": 132,
    "\u2593": 133,
    "\u2599": 134,
    "\u259b": 135,
    "\u259c": 136,
    "\u259f": 137,
    "\u25b2": 138,
    "\u25b6": 139,
    "\u25bc": 140,
    "\u25c0": 141,
    "\u25d8": 142,
    "\u25e2": 143,
    "\u25e3": 144,
    "\u25e4": 145,
    "\u25e5": 146,
    "\u268c": 147,
    "\u29f8": 148,
    "\u29f9": 149
  },
  "idx_to_char": {
    "0": "\n",
    "1": " ",
    "2": "!",
    "3": "\"",
    "4": "#",
    "5": "$",
    "6": "%",
    "7": "&",
    "8": "'",
    "9": "(",
    "10": ")",
    "11": "*",
    "12": "+",
    "13": ",",
    "14": "-",
    "15": ".",
    "16": "/",
    "17": "0",
    "18": "1",
    "19": "2",
    "20": "3",
    "21": "4",
    "22": "5",
    "23": "6",
    "24": "7",
    "25": "8",
    "26": "9",
    "27": ":",
    "28": ";",
    "29": "<",
    "30": "=",
    "31": ">",
    "32": "?",
    "33": "@",
    "34": "A",
    "35": "B",
    "36": "C",
    "37": "D",
    "38": "E",
    "39": "F",
    "40": "G",
    "41": "H",
    "42": "I",
    "43": "J",
    "44": "K",
    "45": "L",
    "46": "M",
    "47": "N",
    "48": "O",
    "49": "P",
    "50": "Q",
    "51": "R",
    "52": "S",
    "53": "T",
    "54": "U",
    "55": "V",
    "56": "W",
    "57": "X",
    "58": "Y",
    "59": "Z",
    "60": "[",
    "61": "\\",
    "62": "]",
    "63": "^",
    "64": "_",
    "65": "`",
    "66": "a",
    "67": "b",
    "68": "c",
    "69": "d",
    "70": "e",
    "71": "f",
    "72": "g",
    "73": "h",
    "74": "i",
    "75": "j",
    "76": "k",
    "77": "l",
    "78": "m",
    "79": "n",
    "80": "o",
    "81": "p",
    "82": "q",
    "83": "r",
    "84": "s",
    "85": "t",
    "86": "u",
    "87": "v",
    "88": "w",
    "89": "x",
    "90": "y",
    "91": "z",
    "92": "{",
    "93": "|",
    "94": "}",
    "95": "~",
    "96": "\u00a1",
    "97": "\u00a4",
    "98": "\u00a7",
    "99": "\u00a8",
    "100": "\u00ac",
    "101": "\u00af",
    "102": "\u00b0",
    "103": "\u00b1",
    "104": "\u00b4",
    "105": "\u00b7",
    "106": "\u00b8",
    "107": "\u00ba",
    "108": "\u00e9",
    "109": "\u00f2",
    "110": "\u00f6",
    "111": "\u00f7",
    "112": "\u02bc",
    "113": "\u02cf",
    "114": "\u0398",
    "115": "\u03a6",
    "116": "\u2026",
    "117": "\u203c",
    "118": "\u221f",
    "119": "\u250c",
    "120": "\u2510",
    "121": "\u2514",
    "122": "\u2518",
    "123": "\u2524",
    "124": "\u2551",
    "125": "\u2580",
    "126": "\u2582",
    "127": "\u2584",
    "128": "\u2588",
    "129": "\u258c",
    "130": "\u2590",
    "131": "\u2591",
    "132": "\u2592",
    "133": "\u2593",
    "134": "\u2599",
    "135": "\u259b",
    "136": "\u259c",
    "137": "\u259f",
    "138": "\u25b2",
    "139": "\u25b6",
    "140": "\u25bc",
    "141": "\u25c0",
    "142": "\u25d8",
    "143": "\u25e2",
    "144": "\u25e3",
    "145": "\u25e4",
    "146": "\u25e5",
    "147": "\u268c",
    "148": "\u29f8",
    "149": "\u29f9"
  }
}