{
  "char_to_idx": {
    "\t": 0,
    "\n": 1,
    " ": 2,
    "!": 3,
    "\"": 4,
    "#": 5,
    "$": 6,
    "%": 7,
    "&": 8,
    "'": 9,
    "(": 10,
    ")": 11,
    "*": 12,
    "+": 13,
    ",": 14,
    "-": 15,
    ".": 16,
    "/": 17,
    "0": 18,
    "1": 19,
    "2": 20,
    "3": 21,
    "4": 22,
    "5": 23,
    "6": 24,
    "7": 25,
    "8": 26,
    "9": 27,
    ":": 28,
    ";": 29,
    "<": 30,
    "=": 31,
    ">": 32,
    "?": 33,
    "@": 34,
    "A": 35,
    "B": 36,
    "C": 37,
    "D": 38,
    "E": 39,
    "F": 40,
    "G": 41,
    "H": 42,
    "I": 43,
    "J": 44,
    "K": 45,
    "L": 46,
    "M": 47,
    "N": 48,
    "O": 49,
    "P": 50,
    "Q": 51,
    "R": 52,
    "S": 53,
    "T": 54,
    "U": 55,
    "V": 56,
    "W": 57,
    "X": 58,
    "Y": 59,
    "Z": 60,
    "[": 61,
    "\\": 62,
    "]": 63,
    "^": 64,
    "_": 65,
    "`": 66,
    "a": 67,
    "b": 68,
    "c": 69,
    "d": 70,
    "e": 71,
    "f": 72,
    "g": 73,
    "h": 74,
    "i": 75,
    "j": 76,
    "k": 77,
    "l": 78,
    "m": 79,
    "n": 80,
    "o": 81,
    "p": 82,
    "q": 83,
    "r": 84,
    "s": 85,
    "t": 86,
    "u": 87,
    "v": 88,
    "w": 89,
    "x": 90,
    "y": 91,
    "z": 92,
    "{": 93,
    "|": 94,
    "}": 95,
    "~": 96,
    "\u00a1": 97,
    "\u00a3": 98,
    "\u00a4": 99,
    "\u00a7": 100,
    "\u00a8": 101,
    "\u00a9": 102,
    "\u00ac": 103,
    "\u00af": 104,
    "\u00b0": 105,
    "\u00b1": 106,
    "\u00b4": 107,
    "\u00b7": 108,
    "\u00b8": 109,
    "\u00ba": 110,
    "\u00e9": 111,
    "\u00f2": 112,
    "\u00f6": 113,
    "\u00f7": 114,
    "\u011b": 115,
    "\u0153": 116,
    "\u02bc": 117,
    "\u02cf": 118,
    "\u0398": 119,
    "\u03a6": 120,
    "\u2026": 121,
    "\u203c": 122,
    "\u221f": 123,
    "\u250c": 124,
    "\u2510": 125,
    "\u2514": 126,
    "\u2518": 127,
    "\u2524": 128,
    "\u2551": 129,
    "\u2580": 130,
    "\u2582": 131,
    "\u2584": 132,
    "\u2588": 133,
    "\u258c": 134,
    "\u2590": 135,
    "\u2591": 136,
    "\u2592": 137,
    "\u2593": 138,
    "\u2599": 139,
    "\u259b": 140,
    "\u259c": 141,
    "\u259f": 142,
    "\u25b2": 143,
    "\u25b6": 144,
    "\u25bc": 145,
    "\u25c0": 146,
    "\u25d8": 147,
    "\u25e2": 148,
    "\u25e3": 149,
    "\u25e4": 150,
    "\u25e5": 151,
    "\u268c": 152,
    "\u29f8": 153,
    "\u29f9": 154
  },
  "idx_to_char": {
    "0": "\t",
    "1": "\n",
    "2": " ",
    "3": "!",
    "4": "\"",
    "5": "#",
    "6": "$",
    "7": "%",
    "8": "&",
    "9": "'",
    "10": "(",
    "11": ")",
    "12": "*",
    "13": "+",
    "14": ",",
    "15": "-",
    "16": ".",
    "17": "/",
    "18": "0",
    "19": "1",
    "20": "2",
    "21": "3",
    "22": "4",
    "23": "5",
    "24": "6",
    "25": "7",
    "26": "8",
    "27": "9",
    "28": ":",
    "29": ";",
    "30": "<",
    "31": "=",
    "32": ">",
    "33": "?",
    "34": "@",
    "35": "A",
    "36": "B",
    "37": "C",
    "38": "D",
    "39": "E",
    "40": "F",
    "41": "G",
    "42": "H",
    "43": "I",
    "44": "J",
    "45": "K",
    "46": "L",
    "47": "M",
    "48": "N",
    "49": "O",
    "50": "P",
    "51": "Q",
    "52": "R",
    "53": "S",
    "54": "T",
    "55": "U",
    "56": "V",
    "57": "W",
    "58": "X",
    "59": "Y",
    "60": "Z",
    "61": "[",
    "62": "\\",
    "63": "]",
    "64": "^",
    "65": "_",
    "66": "`",
    "67": "a",
    "68": "b",
    "69": "c",
    "70": "d",
    "71": "e",
    "72": "f",
    "73": "g",
    "74": "h",
    "75": "i",
    "76": "j",
    "77": "k",
    "78": "l",
    "79": "m",
    "80": "n",
    "81": "o",
    "82": "p",
    "83": "q",
    "84": "r",
    "85": "s",
    "86": "t",
    "87": "u",
    "88": "v",
    "89": "w",
    "90": "x",
    "91": "y",
    "92": "z",
    "93": "{",
    "94": "|",
    "95": "}",
    "96": "~",
    "97": "\u00a1",
    "98": "\u00a3",
    "99": "\u00a4",
    "100": "\u00a7",
    "101": "\u00a8",
    "102": "\u00a9",
    "103": "\u00ac",
    "104": "\u00af",
    "105": "\u00b0",
    "106": "\u00b1",
    "107": "\u00b4",
    "108": "\u00b7",
    "109": "\u00b8",
    "110": "\u00ba",
    "111": "\u00e9",
    "112": "\u00f2",
    "113": "\u00f6",
    "114": "\u00f7",
    "115": "\u011b",
    "116": "\u0153",
    "117": "\u02bc",
    "118": "\u02cf",
    "119": "\u0398",
    "120": "\u03a6",
    "121": "\u2026",
    "122": "\u203c",
    "123": "\u221f",
    "124": "\u250c",
    "125": "\u2510",
    "126": "\u2514",
    "127": "\u2518",
    "128": "\u2524",
    "129": "\u2551",
    "130": "\u2580",
    "131": "\u2582",
    "132": "\u2584",
    "133": "\u2588",
    "134": "\u258c",
    "135": "\u2590",
    "136": "\u2591",
    "137": "\u2592",
    "138": "\u2593",
    "139": "\u2599",
    "140": "\u259b",
    "141": "\u259c",
    "142": "\u259f",
    "143": "\u25b2",
    "144": "\u25b6",
    "145": "\u25bc",
    "146": "\u25c0",
    "147": "\u25d8",
    "148": "\u25e2",
    "149": "\u25e3",
    "150": "\u25e4",
    "151": "\u25e5",
    "152": "\u268c",
    "153": "\u29f8",
    "154": "\u29f9"
  }
}